SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_MegaTiny-1.0.0/boards.txt
##########################################################################
#                                                                        #
#                       ########                 #####                   #
#                          ##                   ##```                    #
#  #   # ####  ###   ##    ##   ### #   # #   # ##      ###  ####  ####  #
#  ## ## #    #     #  #   ##    #  ##  #  # #  ##     #   # #   # #     #
#  # # # ###  #  ## ####   ##    #  # # #   #   ##     #   # ####  ###   #
#  #   # #    #   # #  #   ##    #  #  ##   #   ##___  #   # # #   #     #
#  #   # ####  ###  #  #   ##   ### #   #   #    #####  ###  #  #  ####  #
#________________________________________________________________________#
#                                                                        #
#  Copyright Spence Konde and other             ##       ###        ##   #
#  contributors 2018-2021                      #  #         #      #  #  #
#  megaTinyCore is free software.        # #     #        ##         #   #
#  (LGPL v2.1) see LICENSE.md and        # #    #    ##     #  ##   #    #
#  License section of README.md           #    ####  ##  ###   ##  ####  #
#________________________________________________________________________#
#                                                                        #
#  Now reformatted for easy navigation with text editing tools which     #
#  have the zoomed out view that you can scroll through.                 #
#  The board section headings have a triangle along the right edge       #
#  if they are a non-bootloader definition. Optiboot sections have a     #
#  line inside the right edge if they are for the 2-series parts.        #
#                                                                        #
##########################################################################
#                                                                        #
#          ###  #   #  ####   #   #  ####  #   #  #   #   ###            #
#         #     #   #  #   #  ## ##  #     ##  #  #   #  #               #
#          ###  #   #  ####   # # #  ###   # # #  #   #   ###            #
#             # #   #  #   #  #   #  #     #  ##  #   #      #           #
#          ###   ###   ####   #   #  ####  #   #   ###    ###            #
#________________________________________________________________________#
# The *opti menus are for Optiboot board definitions - We name them
# differently when the option takes on different meaning for a bootloaded
# board. Eg - UPDI can set fuses, so OSCCFG is set on all uploads and
# you don't need to burn bootloader to change clock speed.

menu.chip=Chip or Board
menu.clock=Clock (burn bootloader NOT req'd)
menu.clocko=Clock (burn bootloader req'd, or see docs)
menu.millis=millis()/micros() Timer
menu.startuptime=Startup Time
menu.startuptimeopti=Startup Time (burn bootloader req'd)
menu.bodvoltage=BOD Voltage Level (burn bootloader req'd)
menu.bodmode=BOD Mode when Active/Sleeping (burn bootloader req'd)
menu.eesave=Save EEPROM (burn bootloader req'd)
menu.bootloaderuart=UART for Bootloader (burn bootloader req'd)
menu.resetpin=UPDI/Reset Pin Function (burn bootloader req'd)
menu.resetpinopti=UPDI/Reset Pin and Optiboot Entry (burn bootloader req'd)
menu.resetpinopti_2=UPDI/alt-RST pins and Optiboot Entry (burn bootloader req'd)
menu.uartvoltage=Voltage Baud Correction

##########################################################################
#                                                                        #
###              ####    ###    ###   ####   ####    ###               ###
#####            #   #  #   #  #   #  #   #  #   #  #                #####
#######          ####   #   #  #####  ####   #   #   ###           #######
#####            #   #  #   #  #   #  #  #   #   #      #            #####
###              ####    ###   #   #  #   #  ####    ###               ###
#________________________________________________________________________#
##########################################################################
# Names listed at the top so they can be kept in consistent format

lite.name=Dasduino Lite
liteo.name=Dasduino Lite w/Optiboot

##########################################################################
#  Non-bootloader                                                        #
#                                #    #  #     ####   ###  #   #       ###
#  ATtiny3224/1614/1604         ##    #  #     #   #   #   ##  #     #####
#  ATtiny1624/814/804            #    #### === ####    #   # # #   #######
#  ATtiny824/414/404             #       #     #       #   #  ##     #####
#  ATtiny424/214/204            ###      #     #      ###  #   #       ###
#________________________________________________________________________#

### BUILD PARAMETERS
lite.build.text_section_start=.text=0x0
lite.build.millistimer=D0
lite.build.bootload=
lite.build.board=AVR_ATtinyxy4
lite.build.core=megatinycore
lite.build.variant=txy4
lite.build.mcu=attiny{build.attiny}
lite.build.f_cpu={build.speed}000000L
lite.build.extra_flags=-DARDUINO_attinyxy4 -DMILLIS_USE_TIMER{build.millistimer} -DUARTBAUD{build.uartvoltage}
lite.build.export_merged_output=false

### BOOTLOADING PARAMETERS (FUSES)
lite.bootloader.WDTCFG=0x00
lite.bootloader.BODCFG=0b{bootloader.bodlevbits}{bootloader.bodmodebits}
lite.bootloader.OSCCFG=0x01
lite.bootloader.TCD0CFG=0x00
lite.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
lite.bootloader.APPEND=0x00
lite.bootloader.BOOTEND=0x00
lite.bootloader.tool=avrdude
lite.bootloader.avrdudestring=
lite.bootloader.pymcuprogstring=-aerase

### ALL UPLOADING VIA UPDI
lite.upload.tool=avrdude
lite.upload.workaround=

### CHIP
lite.menu.chip.804=ATtiny804
lite.menu.chip.804.build.board=AVR_ATtiny804
lite.menu.chip.804.build.attiny=804
lite.menu.chip.804.build.millistimer=A0
lite.menu.chip.804.upload.maximum_size=8192
lite.menu.chip.804.upload.maximum_data_size=512

### CLOCK SOURCE
lite.menu.clock.20internal=20 MHz internal
lite.menu.clock.16internal=16 MHz internal
lite.menu.clock.10internal=10 MHz internal
lite.menu.clock.8internal=8 MHz internal
lite.menu.clock.5internal=5 MHz internal
lite.menu.clock.4internal=4 MHz internal
lite.menu.clock.1internal=1 MHz internal
lite.menu.clock.20extclock=20 MHz external clock
lite.menu.clock.16extclock=16 MHz external clock
lite.menu.clock.12extclock=12 MHz external clock
lite.menu.clock.10extclock=10 MHz external clock
lite.menu.clock.8extclock=8 MHz external clock
lite.menu.clock.24extclock=24 MHz external clock (overclocked)
lite.menu.clock.28extclock=28 MHz external clock (overclocked)
lite.menu.clock.32extclock=32 MHz external clock (overclocked)
lite.menu.clock.20internal.build.speed=20
lite.menu.clock.20internal.build.clocksource=0
lite.menu.clock.16internal.build.speed=16
lite.menu.clock.16internal.build.clocksource=0
lite.menu.clock.10internal.build.speed=10
lite.menu.clock.10internal.build.clocksource=0
lite.menu.clock.8internal.build.speed=8
lite.menu.clock.8internal.build.clocksource=0
lite.menu.clock.5internal.build.speed=5
lite.menu.clock.5internal.build.clocksource=0
lite.menu.clock.4internal.build.speed=4
lite.menu.clock.4internal.build.clocksource=0
lite.menu.clock.1internal.build.speed=1
lite.menu.clock.1internal.build.clocksource=0
lite.menu.clock.20extclock.build.speed=20
lite.menu.clock.20extclock.build.clocksource=2
lite.menu.clock.16extclock.build.speed=16
lite.menu.clock.16extclock.build.clocksource=2
lite.menu.clock.12extclock.build.speed=12
lite.menu.clock.12extclock.build.clocksource=2
lite.menu.clock.10extclock.build.speed=10
lite.menu.clock.10extclock.build.clocksource=2
lite.menu.clock.8extclock.build.speed=8
lite.menu.clock.8extclock.build.clocksource=2
lite.menu.clock.24extclock.build.speed=24
lite.menu.clock.24extclock.build.clocksource=2
lite.menu.clock.28extclock.build.speed=28
lite.menu.clock.28extclock.build.clocksource=2
lite.menu.clock.32extclock.build.speed=32
lite.menu.clock.32extclock.build.clocksource=2
lite.menu.clock.20internal.bootloader.OSCCFG=0x02
lite.menu.clock.10internal.bootloader.OSCCFG=0x02
lite.menu.clock.5internal.bootloader.OSCCFG=0x02

### BOD VOLTAGE
lite.menu.bodvoltage.1v8=1.8V (5 MHz or less)
lite.menu.bodvoltage.2v6=2.6V (10 MHz or less)
lite.menu.bodvoltage.4v2=4.2V (20 MHZ or less)
lite.menu.bodvoltage.2v1=2.1V
lite.menu.bodvoltage.2v9=2.9V
lite.menu.bodvoltage.3v3=3.3V
lite.menu.bodvoltage.3v7=3.7V
lite.menu.bodvoltage.4v0=4.0V
lite.menu.bodvoltage.1v8.bootloader.bodlevbits=000
lite.menu.bodvoltage.2v6.bootloader.bodlevbits=010
lite.menu.bodvoltage.4v2.bootloader.bodlevbits=111
lite.menu.bodvoltage.4v0.bootloader.bodlevbits=110
lite.menu.bodvoltage.3v7.bootloader.bodlevbits=101
lite.menu.bodvoltage.3v3.bootloader.bodlevbits=100
lite.menu.bodvoltage.2v9.bootloader.bodlevbits=011
lite.menu.bodvoltage.2v1.bootloader.bodlevbits=001

