SolderedElectronics/Dasduino-Board-Definitions-for-Arduino-IDE/Dasduino_MegaTiny-1.0.0/boards.txt
### BOD MODE
liteo.menu.bodmode.disabled=Disabled/Disabled
liteo.menu.bodmode.enabled=Enabled/Enabled
liteo.menu.bodmode.ensampfast=Enabled/Sampled (1 kHz)
liteo.menu.bodmode.ensampslow=Enabled/Sampled (125 Hz)
liteo.menu.bodmode.sampledfast=Sampled/Sampled (1 kHz)
liteo.menu.bodmode.sampledslow=Sampled/Sampled (125 Hz)
liteo.menu.bodmode.sampdisfast=Sampled/Disabled (1 kHz)
liteo.menu.bodmode.sampdisslow=Sampled/Disabled (125 Hz)
liteo.menu.bodmode.endisholdwake=Enabled hold wakeup/Disabled
liteo.menu.bodmode.disabled.bootloader.BODCFG=0x00
liteo.menu.bodmode.enabled.bootloader.bodmodebits=00101
liteo.menu.bodmode.ensampfast.bootloader.bodmodebits=00110
liteo.menu.bodmode.ensampslow.bootloader.bodmodebits=10110
liteo.menu.bodmode.samplefast.bootloader.bodmodebits=01010
liteo.menu.bodmode.sampleslow.bootloader.bodmodebits=11010
liteo.menu.bodmode.sampdisfast.bootloader.bodmodebits=01000
liteo.menu.bodmode.sampdisslow.bootloader.bodmodebits=11000
liteo.menu.bodmode.endisholdwake.bootloader.bodmodebits=01100

### VOLTAGE FOR UART BAUD CORRECTION
liteo.menu.uartvoltage.skip=Ignore (saves flash, almost always fine)
liteo.menu.uartvoltage.skip.build.uartvoltage=NA
liteo.menu.uartvoltage.5v=Closer to 5v
liteo.menu.uartvoltage.5v.build.uartvoltage=5V
liteo.menu.uartvoltage.3v=Closer to 3v
liteo.menu.uartvoltage.3v.build.uartvoltage=3V

### BOOTLOADER UART PINS
liteo.menu.bootloaderuart.default=TX:5 (PB2), RX:4 (PB3)
liteo.menu.bootloaderuart.alternate=TX:8 (PA1), RX:9 (PA2)
liteo.menu.bootloaderuart.default.bootloader.uartswap=
liteo.menu.bootloaderuart.alternate.bootloader.uartswap=_alt

### UPDI/RESET PIN CONFIGURATION & OPTIBOOT ENTRY
liteo.menu.resetpinopti.UPDI=UPDI, Optiboot for 8 sec. after power-on & reset
liteo.menu.resetpinopti.UPDI.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
liteo.menu.resetpinopti.UPDI.bootloader.resetpinbits=01
liteo.menu.resetpinopti.UPDIFastBoot=UPDI, Optiboot for 1 sec. after power-on & reset
liteo.menu.resetpinopti.UPDIFastBoot.bootloader.file=optiboot_txyz{bootloader.uartswap}_1sec.hex
liteo.menu.resetpinopti.UPDIFastBoot.bootloader.resetpinbits=01
liteo.menu.resetpinopti.reset=Reset, Optiboot for 1 sec. after reset *DANGER* HV UPDI programmer req'd for reprogramming!
liteo.menu.resetpinopti.reset.bootloader.file=optiboot_txyz{bootloader.uartswap}_rst.hex
liteo.menu.resetpinopti.reset.bootloader.resetpinbits=10
liteo.menu.resetpinopti.gpio=GPIO, Optiboot for 8 sec. after power-on & SW reset *DANGER* HV programmer req'd for reprogramming! (PCHV)
liteo.menu.resetpinopti.gpio.bootloader.file=optiboot_txyz{bootloader.uartswap}.hex
liteo.menu.resetpinopti.gpio.bootloader.resetpinbits=00

### STARTUP TIME (SUT)
liteo.menu.startuptimeopti.8=8ms
liteo.menu.startuptimeopti.0=0ms
liteo.menu.startuptimeopti.1=1ms
liteo.menu.startuptimeopti.2=2ms
liteo.menu.startuptimeopti.4=4ms
liteo.menu.startuptimeopti.16=16ms
liteo.menu.startuptimeopti.32=32ms
liteo.menu.startuptimeopti.64=64ms
liteo.menu.startuptimeopti.0.bootloader.SYSCFG1=0x00
liteo.menu.startuptimeopti.1.bootloader.SYSCFG1=0x01
liteo.menu.startuptimeopti.2.bootloader.SYSCFG1=0x02
liteo.menu.startuptimeopti.4.bootloader.SYSCFG1=0x03
liteo.menu.startuptimeopti.8.bootloader.SYSCFG1=0x04
liteo.menu.startuptimeopti.16.bootloader.SYSCFG1=0x05
liteo.menu.startuptimeopti.32.bootloader.SYSCFG1=0x06
liteo.menu.startuptimeopti.64.bootloader.SYSCFG1=0x07
